# Questions [40marks]
* Q1 Who did spend most money for renting?
* Q2 Which room does make the most amount of income?
* Q3 How many times Jack Jones rent the room?
* Q4 How many times Claire Taylor rent each room?
* Q5 what is the total income of ALL rooms in June? Between 1st June 2018(inclusive) and 30th June 2018(inclusive), (use return date).
* Q6 What are the total incomes of EACH room in June? Between 1st June 2018(inclusive) and 30th June 2018(inclusive), (use return date)
* Q7 Find members that have total rent time exactly 8 hours in June?
* Q8 Find members that have total rent time greater than or equal than 9 hours in June?
* Q9 Find the total rent duration of EACH room in June?
* Q10 Find the total income of EACH room in June?

# คำถาม [ข้อละ 4 คะแนน รวม 40 คะแนน]
* Q1 ใครจ่ายเงินค่าเช่ามากที่สุด
* Q2 ห้องเช่าใดทำรายได้มากที่สุด
* Q3 Jack Jones เช่าห้องไปกี่ครั้ง
* Q4 Claire Taylor เช่าแต่ละห้องไปกี่ครั้ง
* Q5 ในเดือนมิถุนายนมีรายรับรวมเท่าใด
* Q6 ในเดือนมิถุนายนแต่ละห้องมีรายรับรวมเท่าใด
* Q7 หาชื่อสมาชิกที่เช่าห้อง 8 ชั่วโมงในเดือนมิถุนายน
* Q8 หาชื่อสมาชิกที่เช่าห้องมากกว่าหรือเท่ากับ 9 ชั่วโมงในเดือนมิถุนายน
* Q9 หาระยะเวลาเช่ารวมของแต่ละห้องในเดือนมิถุนายน
* Q10 หารายได้รวมของแต่ละห้องในเดือนมิถุนายน

In [1]:
import pandas as pd

In [17]:
df_member = pd.read_csv('member.csv')
df_member.drop(labels=['Unnamed: 0', 'mobile'], axis=1, inplace=True)
df_room = pd.read_csv('room.csv')
df_room.drop(labels=['Unnamed: 0', 'isavailable'], axis=1, inplace=True)
df_rent = pd.read_csv('rent.csv')
df_rent.drop(labels=['Unnamed: 0'], axis=1, inplace=True)

In [18]:
df_member.head()

   id            name
0   1  Oscar Williams
1   2     James Jones
2   3   Claire Thomas
3   4  Oliver Johnson
4   5    Oliver Jones

In [19]:
df_room.head()

   id  number  hour_price
0   6     101         105
1   7     102         100
2   8     103         170
3   9     104         130
4  10     105         199

In [20]:
df_rent.head()

,id,start,stop,member_id,room_id,cost
0,383,2018-05-09 08:01:18.462109,2018-05-09 09:01:18.462109,48,7,100.0
1,384,2018-05-09 08:01:18.462109,2018-05-09 10:01:18.462109,1,9,260.0
2,385,2018-05-09 09:01:18.462109,2018-05-09 10:01:18.462109,67,10,199.0
3,386,2018-05-09 10:01:18.462109,2018-05-09 12:01:18.462109,18,7,200.0
4,387,2018-05-09 12:01:18.462109,2018-05-09 15:01:18.462109,86,6,315.0

In [45]:
df=df_rent\
    .merge(df_member, left_on='member_id', right_on='id')\
    .drop(labels=['id_y'], axis=1)\
    .merge(df_room, left_on='room_id', right_on='id')\
    .drop(labels=['id'], axis=1)

In [46]:
df.head()

,id_x,start,stop,member_id,room_id,cost,name,number,hour_price
0,383,2018-05-09 08:01:18.462109,2018-05-09 09:01:18.462109,48,7,100.0,Thomas Thomas,102,100
1,1839,2018-07-10 12:01:18.462109,2018-07-10 13:01:18.462109,48,7,100.0,Thomas Thomas,102,100
2,2676,2018-08-16 01:01:18.462109,2018-08-16 02:01:18.462109,48,7,100.0,Thomas Thomas,102,100
3,3044,2018-08-31 02:01:18.462109,2018-08-31 03:01:18.462109,48,7,100.0,Thomas Thomas,102,100
4,3105,2018-09-02 13:01:18.462109,2018-09-02 16:01:18.462109,48,7,300.0,Thomas Thomas,102,100

# Q1 Who did spend most money for renting?

In [57]:
df.groupby(by=['member_id','name'])\
    .agg({'cost' : ['sum']})\
    .sort_values(('cost','sum'),ascending=False)\
    .head(1)

                          cost
                           sum
member_id name
94        Oscar Smith  15116.0

# Q2 Which room does make the most amount of income?

In [59]:
df.groupby(by=['room_id','number'])\
    .agg({'cost' : ['sum']})\
    .sort_values(('cost','sum'),ascending=False)\
    .head(1)

                    cost
                     sum
room_id number
10      105     269645.0

# Q3 How many times Jack Jones rent the room?

In [65]:
df.iloc[1]

id_x                                1839
start         2018-07-10 12:01:18.462109
stop          2018-07-10 13:01:18.462109
member_id                             48
room_id                                7
cost                                 100
name                       Thomas Thomas
number                               102
hour_price                           100
Name: 1, dtype: object

In [71]:
df[ df['name']=='Jack Jones' ].count()

id_x          35
start         35
stop          35
member_id     35
room_id       35
cost          35
name          35
number        35
hour_price    35
dtype: int64